ferhatkdz/EDM_Control/bsp_hal/src/bsp_hal_nu_m251.c
#include "bsp_hal.h"

extern uint32_t pinmap_function(PinName pin, const PinMap *map);
extern uint32_t pinmap_function_ex(PinName pin, uint32_t peripheral, const PinMap *map);
extern uint32_t pinmap_channel(PinName pin, uint32_t peripheral, const PinMap *map);

static UartDataReceivedIRQhandler uartDataReceivedIRQhandler = 0;

static const uint32_t MODES[] = {
	GPIO_MODE_INPUT,
	GPIO_MODE_OUTPUT,
};

static const uint32_t PULLS[] = {
	GPIO_PUSEL_DISABLE,
	GPIO_PUSEL_PULL_UP,
	GPIO_PUSEL_PULL_DOWN
};

const uint32_t DATABITS[] = {
		UART_WORD_LEN_5,
		UART_WORD_LEN_6,
		UART_WORD_LEN_7,
		UART_WORD_LEN_8,
		UART_WORD_LEN_8
};

const uint32_t STOPBITS[] = {
		UART_STOP_BIT_1,
		UART_STOP_BIT_1,
		UART_STOP_BIT_2,
		UART_STOP_BIT_1_5
};

const uint32_t PARITY[] = {
		UART_PARITY_NONE,
		UART_PARITY_EVEN,
		UART_PARITY_ODD
};

uint32_t uart_irq_number_get(const uint8_t uart_index) 
{
	uint32_t irq_number = 0;
	switch (uart_index) {
#if defined(UART0)
	case UART_IND0:
		irq_number = UART0_IRQn;
		break;
#endif
#if defined(UART1)
	case UART_IND1:
		irq_number = UART1_IRQn;
		break;
#endif
#if defined(UART2)
	case UART_IND2:
		irq_number = UART2_IRQn;
		break;
#endif
#if defined(UART3)
	case UART_IND3:
		irq_number = UART3_IRQn;
		break;
#endif
	default:
		break;
	}
	return irq_number;
}

static uint32_t gpio_periph_clock_enable(const PinName pin){
	uint8_t port = PORT_GET(pin);
	switch(port) {
	#if defined(_PA0)
		case 0:
			CLK_EnableModuleClock(GPA_MODULE);
			return GPIOA_BASE;
	#endif
	#if defined(_PB0)
		case 1:
			CLK_EnableModuleClock(GPB_MODULE);
			return GPIOB_BASE;
	#endif
	#if defined(_PC0)
		case 2:
			CLK_EnableModuleClock(GPC_MODULE);
			return GPIOC_BASE;
	#endif
	#if defined(_PD0)
		case 3:
			CLK_EnableModuleClock(GPD_MODULE);
			return GPIOD_BASE;
	#endif
	#if defined(_PE0)
		case 4:
			CLK_EnableModuleClock(GPE_MODULE);
			return GPIOE_BASE;
	#endif
	#if defined(_PF0)
		case 5:
			CLK_EnableModuleClock(GPF_MODULE);
			return GPIOF_BASE;
	#endif
	}
	return 0;
}

static uint32_t uart_periph_clock_enable(const uint8_t index){
	uint32_t addr;
	uint32_t uart_rst;

	/* Unlock protected registers */
	SYS_UnlockReg();

	switch(index) {
#if defined(UART0)
	case 0:
		addr = UART0_BASE;
		uart_rst = UART0_RST;
		/* Switch UART0 clock source to HIRC */
		CLK_SetModuleClock(UART0_MODULE, CLK_CLKSEL1_UART0SEL_HIRC, CLK_CLKDIV0_UART0(1));
		/* Enable UART peripheral clock */
		CLK_EnableModuleClock(UART0_MODULE);
		break;
#endif
#if defined(UART1)
	case 1:
		addr = UART1_BASE;
		uart_rst = UART1_RST;
		/* Switch UART1 clock source to HIRC */
		//CLK_SetModuleClock(UART1_MODULE, CLK_CLKSEL1_UART1SEL_HIRC, CLK_CLKDIV0_UART1(1));
		/* Enable UART peripheral clock */
		CLK_EnableModuleClock(UART1_MODULE);
		break;
#endif
#if defined(UART2)
	case 2:
		addr = UART2_BASE;
		uart_rst = UART2_RST;
		/* Switch UART2 clock source to HIRC */
		//CLK_SetModuleClock(UART2_MODULE, CLK_CLKSEL3_UART2SEL_HIRC, CLK_CLKDIV4_UART2(1));
		/* Enable UART peripheral clock */
		CLK_EnableModuleClock(UART2_MODULE);
		break;
#endif
	}

	/* Update System Core Clock */
	/* User can use SystemCoreClockUpdate() to calculate PllClock, SystemCoreClock and CycylesPerUs automatically. */
	SystemCoreClockUpdate();


	/* Lock protected registers */
	SYS_LockReg();

	/* Reset UART */
	SYS_ResetModule(uart_rst);

	return addr;
}


void bsp_hal_gpio_init(gpio_t * const gpio,const uint8_t initial_pin_state) {
	
		/* GET PERIPHERAL ADDRES & ENABLE RCU_CLOCK */
		gpio->addr = gpio_periph_clock_enable(gpio->pin);
		
		/* GET PIN MASK */
		gpio->mask = 1 << PIN_GET(gpio->pin);
	
		/* SET INITIAL PIN STATE */
		if (initial_pin_state!=2)  bsp_hal_gpio_write(gpio,initial_pin_state);

		/* SET MODE */
		if (gpio->outtype == HAL_GPIO_OTYPE_OD) GPIO_SetMode((GPIO_T*)gpio->addr, gpio->mask, GPIO_MODE_OPEN_DRAIN);
		else if (gpio->outtype == HAL_GPIO_OTYPE_QUASI) GPIO_SetMode((GPIO_T*)gpio->addr, gpio->mask, GPIO_MODE_QUASI);
		else GPIO_SetMode((GPIO_T*)gpio->addr, gpio->mask, MODES[gpio->mode]);
	
		/* SET PULL MODE */
		GPIO_SetPullCtl((GPIO_T*)gpio->addr, gpio->mask, PULLS[gpio->pull]);
		
}

/* PWM OUT PinMap */
const PinMap PinMap_PWM_OUT[] = {
    {.pin = PA5, 	.peripheral = 0, 	.channel = 0, .function = SYS_GPA_MFPL_PA5MFP_PWM0_CH0},
    {.pin = PB5, 	.peripheral = 0, 	.channel = 0, .function = SYS_GPB_MFPL_PB5MFP_PWM0_CH0},
    {.pin = PE7, 	.peripheral = 0, 	.channel = 0, .function = SYS_GPE_MFPL_PE7MFP_PWM0_CH0},
    {.pin = PE8, 	.peripheral = 0, 	.channel = 0, .function = SYS_GPE_MFPH_PE8MFP_PWM0_CH0},
    {.pin = PF5, 	.peripheral = 0, 	.channel = 0, .function = SYS_GPF_MFPL_PF5MFP_PWM0_CH0},

    {.pin = PA4, 	.peripheral = 0, 	.channel = 1, .function = SYS_GPA_MFPL_PA4MFP_PWM0_CH1},
    {.pin = PB4, 	.peripheral = 0, 	.channel = 1, .function = SYS_GPB_MFPL_PB4MFP_PWM0_CH1},
    {.pin = PE6, 	.peripheral = 0, 	.channel = 1, .function = SYS_GPE_MFPL_PE6MFP_PWM0_CH1},
    {.pin = PE9, 	.peripheral = 0, 	.channel = 1, .function = SYS_GPE_MFPH_PE9MFP_PWM0_CH1},
    {.pin = PF4, 	.peripheral = 0, 	.channel = 1, .function = SYS_GPF_MFPL_PF4MFP_PWM0_CH1},

    {.pin = PA3, 	.peripheral = 0, 	.channel = 2, .function = SYS_GPA_MFPL_PA3MFP_PWM0_CH2},
    {.pin = PB3, 	.peripheral = 0, 	.channel = 2, .function = SYS_GPB_MFPL_PB3MFP_PWM0_CH2},
    {.pin = PE5, 	.peripheral = 0, 	.channel = 2, .function = SYS_GPE_MFPL_PE5MFP_PWM0_CH2},
    {.pin = PE10, .peripheral = 0, 	.channel = 2, .function = SYS_GPE_MFPH_PE10MFP_PWM0_CH2},

    {.pin = PA2, 	.peripheral = 0, 	.channel = 3, .function = SYS_GPA_MFPL_PA2MFP_PWM0_CH3},
    {.pin = PB2, 	.peripheral = 0, 	.channel = 3, .function = SYS_GPB_MFPL_PB2MFP_PWM0_CH3},
    {.pin = PE4, 	.peripheral = 0, 	.channel = 3, .function = SYS_GPE_MFPL_PE4MFP_PWM0_CH3},
    {.pin = PE11, .peripheral = 0, 	.channel = 3, .function = SYS_GPE_MFPH_PE11MFP_PWM0_CH3},

    {.pin = PA1, 	.peripheral = 0, 	.channel = 4, .function = SYS_GPA_MFPL_PA1MFP_PWM0_CH4},
    {.pin = PB1, 	.peripheral = 0, 	.channel = 4, .function = SYS_GPB_MFPL_PB1MFP_PWM0_CH4},
    {.pin = PE3, 	.peripheral = 0, 	.channel = 4, .function = SYS_GPE_MFPL_PE3MFP_PWM0_CH4},
    {.pin = PE12, .peripheral = 0, 	.channel = 4, .function = SYS_GPE_MFPH_PE12MFP_PWM0_CH4},
    {.pin = PF14, .peripheral = 0, 	.channel = 4, .function = SYS_GPF_MFPH_PF14MFP_PWM0_CH4},

    {.pin = PA0, 	.peripheral = 0, 	.channel = 5, .function = SYS_GPA_MFPL_PA0MFP_PWM0_CH5},
    {.pin = PB0, 	.peripheral = 0, 	.channel = 5, .function = SYS_GPB_MFPL_PB0MFP_PWM0_CH5},
    {.pin = PD15, .peripheral = 0, 	.channel = 5, .function = SYS_GPD_MFPH_PD15MFP_PWM0_CH5},
    {.pin = PE2, 	.peripheral = 0, 	.channel = 5, .function = SYS_GPE_MFPL_PE2MFP_PWM0_CH5},
    {.pin = PE13, .peripheral = 0, 	.channel = 5, .function = SYS_GPE_MFPH_PE13MFP_PWM0_CH5},
		
