ferhatkdz/EDM_Control/bsp_hal/src/bsp_hal_nu_m251.c
    {.pin = PB15, .peripheral = 1, 	.channel = 0, .function = SYS_GPB_MFPH_PB15MFP_PWM1_CH0},
    {.pin = PC5, 	.peripheral = 1, 	.channel = 0, .function = SYS_GPC_MFPL_PC5MFP_PWM1_CH0},
    {.pin = PC12, .peripheral = 1, 	.channel = 0, .function = SYS_GPC_MFPH_PC12MFP_PWM1_CH0},
    {.pin = PE13, .peripheral = 1, 	.channel = 0, .function = SYS_GPE_MFPH_PE13MFP_PWM1_CH0},
		
    {.pin = PB14, .peripheral = 1, 	.channel = 1, .function = SYS_GPB_MFPH_PB14MFP_PWM1_CH1},
    {.pin = PC4,  .peripheral = 1, 	.channel = 1, .function = SYS_GPC_MFPL_PC4MFP_PWM1_CH1},
    {.pin = PC8,  .peripheral = 1, 	.channel = 1, .function = SYS_GPC_MFPH_PC8MFP_PWM1_CH1},
    {.pin = PC11, .peripheral = 1, 	.channel = 1, .function = SYS_GPC_MFPH_PC11MFP_PWM1_CH1},

    {.pin = PB13, .peripheral = 1, 	.channel = 2, .function = SYS_GPB_MFPH_PB13MFP_PWM1_CH2},
    {.pin = PC3,  .peripheral = 1, 	.channel = 2, .function = SYS_GPC_MFPL_PC3MFP_PWM1_CH2},
    {.pin = PC7,  .peripheral = 1, 	.channel = 2, .function = SYS_GPC_MFPL_PC7MFP_PWM1_CH2},
    {.pin = PC10, .peripheral = 1, 	.channel = 2, .function = SYS_GPC_MFPH_PC10MFP_PWM1_CH2},

    {.pin = PB12, .peripheral = 1, 	.channel = 3, .function = SYS_GPB_MFPH_PB12MFP_PWM1_CH3},
    {.pin = PC2,  .peripheral = 1, 	.channel = 3, .function = SYS_GPC_MFPL_PC2MFP_PWM1_CH3},
    {.pin = PC6,  .peripheral = 1, 	.channel = 3, .function = SYS_GPC_MFPL_PC6MFP_PWM1_CH3},
    {.pin = PC9,  .peripheral = 1, 	.channel = 3, .function = SYS_GPC_MFPH_PC9MFP_PWM1_CH3},

    {.pin = PA7,  .peripheral = 1, 	.channel = 4, .function = SYS_GPA_MFPL_PA7MFP_PWM1_CH4},
    {.pin = PB1,  .peripheral = 1, 	.channel = 4, .function = SYS_GPB_MFPL_PB1MFP_PWM1_CH4},
    {.pin = PB7,  .peripheral = 1, 	.channel = 4, .function = SYS_GPB_MFPL_PB7MFP_PWM1_CH4},
    {.pin = PC1,  .peripheral = 1, 	.channel = 4, .function = SYS_GPC_MFPL_PC1MFP_PWM1_CH4},

    {.pin = PA6,  .peripheral = 1, 	.channel = 5, .function = SYS_GPA_MFPL_PA6MFP_PWM1_CH5},
    {.pin = PB0,  .peripheral = 1, 	.channel = 5, .function = SYS_GPB_MFPL_PB0MFP_PWM1_CH5},
    {.pin = PB6,  .peripheral = 1, 	.channel = 5, .function = SYS_GPB_MFPL_PB6MFP_PWM1_CH5},
    {.pin = PC0,  .peripheral = 1, 	.channel = 5, .function = SYS_GPC_MFPL_PC0MFP_PWM1_CH5},
		
    {NC}
};

	
/* UART PinMap */
const PinMap PinMap_UART[] = {
    {.pin = PA0, 	.function = SYS_GPA_MFPL_PA0MFP_UART0_RXD},
    {.pin = PA1, 	.function = SYS_GPA_MFPL_PA1MFP_UART0_TXD},
		
    {.pin = PA4, 	.function = SYS_GPA_MFPL_PA4MFP_UART0_RXD},
		{.pin = PA5, 	.function = SYS_GPA_MFPL_PA5MFP_UART0_TXD},

    {.pin = PA6, 	.function = SYS_GPA_MFPL_PA6MFP_UART0_RXD},
    {.pin = PA7, 	.function = SYS_GPA_MFPL_PA7MFP_UART0_TXD},
		
    {.pin = PA15, .function = SYS_GPA_MFPH_PA15MFP_UART0_RXD},
    {.pin = PA14, .function = SYS_GPA_MFPH_PA14MFP_UART0_TXD},
		
		{.pin = PB8, 	.function = SYS_GPB_MFPH_PB8MFP_UART0_RXD},
		{.pin = PB9, 	.function = SYS_GPB_MFPH_PB9MFP_UART0_TXD},
		
    {.pin = PB12, .function = SYS_GPB_MFPH_PB12MFP_UART0_RXD},
    {.pin = PB13, .function = SYS_GPB_MFPH_PB13MFP_UART0_TXD},
		
		{.pin = PF2, 	.function = SYS_GPF_MFPL_PF2MFP_UART0_RXD},
		{.pin = PF3, 	.function = SYS_GPF_MFPL_PF3MFP_UART0_TXD},
		
    {.pin = PA2, 	.function = SYS_GPA_MFPL_PA2MFP_UART1_RXD},
		{.pin = PA3, 	.function = SYS_GPA_MFPL_PA3MFP_UART1_TXD},

    {.pin = PA8, 	.function = SYS_GPA_MFPH_PA8MFP_UART1_RXD},
    {.pin = PA9, 	.function = SYS_GPA_MFPH_PA9MFP_UART1_TXD},
    
		{.pin = PB2, 	.function = SYS_GPB_MFPL_PB2MFP_UART1_RXD},
    {.pin = PB3, 	.function = SYS_GPB_MFPL_PB3MFP_UART1_TXD},
    
		{.pin = PB6,  .function = SYS_GPB_MFPL_PB6MFP_UART1_RXD},
    {.pin = PB7,  .function = SYS_GPB_MFPL_PB7MFP_UART1_TXD},
		
		{.pin = PF1, 	.function = SYS_GPF_MFPL_PF1MFP_UART1_RXD},
		{.pin = PF0, 	.function = SYS_GPF_MFPL_PF0MFP_UART1_TXD},
	  
		{.pin = PC0, 	.function = SYS_GPC_MFPL_PC0MFP_UART2_RXD},
	  {.pin = PC1, 	.function = SYS_GPC_MFPL_PC1MFP_UART2_TXD},

    {.pin = PC4, 	.function = SYS_GPC_MFPL_PC4MFP_UART2_RXD},
    {.pin = PC5, 	.function = SYS_GPC_MFPL_PC5MFP_UART2_TXD},

    {.pin = PB0, 	.function = SYS_GPB_MFPL_PB0MFP_UART2_RXD},
    {.pin = PB1, 	.function = SYS_GPB_MFPL_PB1MFP_UART2_TXD},

    {.pin = PB4,  .function = SYS_GPB_MFPL_PB4MFP_UART2_RXD},
    {.pin = PB5,  .function = SYS_GPB_MFPL_PB5MFP_UART2_TXD},

		{.pin = PE15, .function = SYS_GPE_MFPH_PE15MFP_UART2_RXD},
		{.pin = PE14, .function = SYS_GPE_MFPH_PE14MFP_UART2_TXD},

		{.pin = PF5, 	.function = SYS_GPF_MFPL_PF5MFP_UART2_RXD},
		{.pin = PF4, 	.function = SYS_GPF_MFPL_PF4MFP_UART2_TXD},

    {NC}
};



void bsp_hal_pwm_clk_init(int pwm_module_index){

	/* Unlock protected registers */
  SYS_UnlockReg();	
	
	if (pwm_module_index & PWM0_INDEX) {
		/* Enable PWM module clock */
		CLK_EnableModuleClock(PWM0_MODULE);
		CLK_SetModuleClock(PWM0_MODULE, CLK_CLKSEL2_PWM0SEL_PCLK0, 0);

		/* Reset PWM module */
		SYS_ResetModule(PWM0_RST);

	}
	
	if (pwm_module_index & PWM1_INDEX) {
		/* Enable PWM module clock */
		CLK_EnableModuleClock(PWM1_MODULE);
		CLK_SetModuleClock(PWM1_MODULE, CLK_CLKSEL2_PWM1SEL_PCLK1, 0);

		/* Reset PWM module */
		SYS_ResetModule(PWM1_RST);
	}
		
	/* Update System Core Clock */
	SystemCoreClockUpdate();	
	
	/* Lock protected registers */
	SYS_LockReg();		
}

void bsp_hal_pwm_out_pin_init(pwm_out_t * const pwm_out) {
		timer_t *timer = pwm_out->timer;
	
	
		pwm_out->channel = pinmap_channel(pwm_out->pin,timer->index,(PinMap*)&PinMap_PWM_OUT);
	
		/* Unlock protected registers */
    SYS_UnlockReg();

		/* Set multi-function pins for PWM x Channel y */
	
		bsp_gpio_set_multi_function(pwm_out->pin, pinmap_function_ex(pwm_out->pin,timer->index, (PinMap*)&PinMap_PWM_OUT));
	
		//uint32_t *reg = (uint32_t *)SYS + 12 + (PORT_GET(pwm_out->pin) * 2) + (PIN_GET(pwm_out->pin) / 8) ;
		//*reg = (*reg & ~(0xful<<((PIN_GET(pwm_out->pin) % 8) * 4))) | pinmap_function_ex(pwm_out->pin,timer->index, (PinMap*)&PinMap_PWM_OUT);
		
