ferhatkdz/EDM_Control/bsp_hal/src/bsp_hal_nu_m251.c
		/* Lock protected registers */
    SYS_LockReg();				
		
		if (timer->index == 0) {
			/* PWM channel n frequency is 2000Hz, duty 50%, */
			PWM_ConfigOutputChannel(PWM0, pwm_out->channel, timer->pwm_frequency, 0);
		
			/* Enable output of PWM0 channel n*/
			PWM_EnableOutput(PWM0, 1<<pwm_out->channel); //PWM_CH_0_MASK
		}else if (timer->index == 1) {
			/* PWM1 channel n frequency is 2000Hz, duty 50%, */
			PWM_ConfigOutputChannel(PWM1, pwm_out->channel, timer->pwm_frequency, 0);
		
			/* Enable output of PWM1 channel n */
			PWM_EnableOutput(PWM1, 1<<pwm_out->channel); //PWM_CH_0_MASK
		}
}

void bsp_hal_pwm_set_frequency(pwm_out_t * const pwm_out, uint32_t frequency, uint32_t duty) {
		timer_t *timer = pwm_out->timer;
	
		pwm_out->channel = pinmap_channel(pwm_out->pin,timer->index,(PinMap*)&PinMap_PWM_OUT);
	
		
		if (timer->index == 0) {
			/* PWM channel n frequency is 2000Hz, duty 50%, */
			PWM_ConfigOutputChannel(PWM0, pwm_out->channel, frequency, duty);
		
			/* Enable output of PWM0 channel n*/
			PWM_EnableOutput(PWM0, 1<<pwm_out->channel); //PWM_CH_0_MASK
		}else if (timer->index == 1) {
			/* PWM1 channel n frequency is 2000Hz, duty 50%, */
			PWM_ConfigOutputChannel(PWM1, pwm_out->channel, frequency, duty);
		
			/* Enable output of PWM1 channel n */
			PWM_EnableOutput(PWM1, 1<<pwm_out->channel); //PWM_CH_0_MASK
		}
}

void bsp_hal_pwm_in_pin_init(pwm_in_t * const pwm_in) {
	
		PWM_T *PWM = (pwm_in->NUVOTON_pwm_capture.pwmModuleIndex == 0) ? PWM0 : PWM1;
		int channel = pinmap_channel(pwm_in->NUVOTON_pwm_capture.pin,pwm_in->NUVOTON_pwm_capture.pwmModuleIndex,(PinMap*)&PinMap_PWM_OUT);
		pwm_in->NUVOTON_pwm_capture.pwmChannel = channel;
	
		/* Unlock protected registers */
    SYS_UnlockReg();
		/* Set multi-function pins for PWM x Channel y */
	
		bsp_gpio_set_multi_function(pwm_in->NUVOTON_pwm_capture.pin,  pinmap_function_ex(pwm_in->NUVOTON_pwm_capture.pin,pwm_in->NUVOTON_pwm_capture.pwmModuleIndex, (PinMap*)&PinMap_PWM_OUT));
	
		//uint32_t *reg = (uint32_t *)SYS + 12 + (PORT_GET(pwm_in->NUVOTON_pwm_capture.pin) * 2) + (PIN_GET(pwm_in->NUVOTON_pwm_capture.pin) / 8) ;
		//*reg = (*reg & ~(0xful<<((PIN_GET(pwm_in->NUVOTON_pwm_capture.pin) % 8) * 4))) | pinmap_function_ex(pwm_in->NUVOTON_pwm_capture.pin,pwm_in->NUVOTON_pwm_capture.pwmModuleIndex, (PinMap*)&PinMap_PWM_OUT);
		/* Lock protected registers */
    SYS_LockReg();
	
		/* set PWMx channel n capture configuration */
		PWM_ConfigCaptureChannel(PWM, channel, pwm_in->NUVOTON_pwm_capture.timeNSec, 0);
		/* Enable Timer for PWMx channel n */
		PWM_Start(PWM, 1<<channel); //PWM_CH_n_MASK
		/* Enable Capture Function for PWMx channel n */
		PWM_EnableCapture(PWM, 1<<channel); //PWM_CH_n_MASK
		/* Enable falling capture reload */
    PWM->CAPCTL |= (0x1ul << (PWM_CAPCTL_FCRLDEN0_Pos+channel));
		/* clear pending capture interrupts */
		PWM_ClearCaptureIntFlag(PWM, channel, PWM_CAPTURE_INT_RISING_LATCH);
		PWM_ClearCaptureIntFlag(PWM, channel, PWM_CAPTURE_INT_FALLING_LATCH);
}

void bsp_hal_pwm_in_dma_init(pwm_in_t * const pwm_in, int *counter_value) {
		PWM_T *PWM = (pwm_in->NUVOTON_pwm_capture.pwmModuleIndex == 0) ? PWM0 : PWM1;
		int dmaChannel = pwm_in->NUVOTON_pwm_capture.dmaChannel;
		int pwmChannel = pinmap_channel(pwm_in->NUVOTON_pwm_capture.pin,pwm_in->NUVOTON_pwm_capture.pwmModuleIndex,(PinMap*)&PinMap_PWM_OUT);
		int pwmPair = pwmChannel/2;
	
		/* Unlock protected registers */
		SYS_UnlockReg();
		/* Enable PDMA module clock */
    CLK_EnableModuleClock(PDMA_MODULE);
		/* Lock protected registers */
    SYS_LockReg();
	
		/*--------------------------------------------------------------------------------------*/
		/* Configure PDMA peripheral mode form PWM to memory                                    */
		/*--------------------------------------------------------------------------------------*/
		/* Open Channel n */
		PDMA_Open(PDMA, (1<<dmaChannel ));
		/* Transfer width is half word(32 bit) and transfer count is 1 */
		PDMA_SetTransferCnt(PDMA, dmaChannel, PDMA_WIDTH_32, 1);
		/* Set source address as PWM capture channel PDMA register(no increment) and destination address as g_u16Count array(increment) */
		PDMA_SetTransferAddr(PDMA, dmaChannel, (uint32_t)&PWM->PDMACAP[pwmPair], PDMA_SAR_FIX, (uint32_t)counter_value, PDMA_DAR_FIX);
			/* Select PDMA request source as PWM RX(PWM1 channel 0 should be PWM1 pair 1) */
		PDMA_SetTransferMode(PDMA, dmaChannel, PDMA_PWM1_P1_RX+pwmPair, FALSE, 0);
		/* Set PDMA as single request type for PWM */
		PDMA_SetBurstType(PDMA, dmaChannel, PDMA_REQ_SINGLE, PDMA_BURST_1);
		/* Enable PDMA for PWM0 channel 2 capture function, and set capture order as falling first, */
		/* And select capture mode as both rising and falling to do PDMA transfer. */
		PWM_EnablePDMA(PWM, pwmChannel, TRUE, PWM_CAPTURE_PDMA_RISING_LATCH);
		/* enable PDMA_INT_TRANS_DONE */
		PDMA_EnableInt(PDMA, dmaChannel, PDMA_INT_TRANS_DONE);
}

void bsp_hal_pwm_start(pwm_out_t * const pwm_out) {
	timer_t *timer = pwm_out->timer;
	if (timer->index == 0) {
		PWM_Start(PWM0, 1<<pwm_out->channel);
	}else if (timer->index == 1) {
		PWM_Start(PWM1, 1<<pwm_out->channel);
	}
}

void bsp_hal_pwm_out_pin_set_duty(const pwm_out_t* const pwm_out, uint16_t duty) {
	uint32_t u32CycleResolution = 0xff; //255;
	uint32_t newCMR;
	PWM_T *pwm = (pwm_out->timer->index == 0) ? PWM0 : PWM1;
	
	if (duty >= u32CycleResolution) {
		newCMR = PWM_GET_CNR(pwm, pwm_out->channel);
	}else {
		newCMR = (duty * (PWM_GET_CNR(pwm, pwm_out->channel) + 1) / u32CycleResolution);
	}

	PWM_SET_CMR(pwm, pwm_out->channel, newCMR);
	
}

void bsp_hal_pwm_out_pin_set_duty_100(const pwm_out_t* const pwm_out, uint16_t duty) {
	uint32_t u32CycleResolution = 100;
	uint32_t newCMR;
	PWM_T *pwm = (pwm_out->timer->index == 0) ? PWM0 : PWM1;
	
	if (duty >= u32CycleResolution) {
		newCMR = PWM_GET_CNR(pwm, pwm_out->channel);
	}else {
		newCMR = (duty * (PWM_GET_CNR(pwm, pwm_out->channel) + 1) / u32CycleResolution);
	}

	PWM_SET_CMR(pwm, pwm_out->channel, newCMR);
	
