ferhatkdz/EDM_Control/bsp_hal/src/bsp_hal_nu_m251.c
}


void bsp_hal_uart_init(uart_t * const uart) {

	
	uart->addr =  uart_periph_clock_enable(uart->index);

	/* Unlock protected registers */
	SYS_UnlockReg();

	
	/* Set GPx multi-function pins for UART RXD */
	bsp_gpio_set_multi_function(uart->rxpin, pinmap_function(uart->rxpin,(PinMap*)&PinMap_UART));
	//uint32_t *reg = (uint32_t *)SYS + 12 + (PORT_GET(uart->rxpin) * 2) + (PIN_GET(uart->rxpin) / 8) ;
	//*reg = (*reg & ~(0xful<<((PIN_GET(uart->rxpin) % 8) * 4))) | pinmap_function(uart->rxpin,(PinMap*)&PinMap_UART);

	/* Set GPx multi-function pins for UART TXD */
	bsp_gpio_set_multi_function(uart->txpin, pinmap_function(uart->txpin,(PinMap*)&PinMap_UART));
	//uint32_t *reg_tx = (uint32_t *)SYS + 12 + (PORT_GET(uart->txpin) * 2) + (PIN_GET(uart->txpin) / 8) ;
	//*reg_tx = (*reg_tx & ~(0xful<<((PIN_GET(uart->txpin) % 8) * 4))) | pinmap_function(uart->txpin,(PinMap*)&PinMap_UART);
	
	#if 0
	/* Set GPx multi-function pins for UART RXD and TXD */
	switch(uart->rxpin) {
	case PA0:  SYS->GPA_MFPL = (SYS->GPA_MFPL & ~(SYS_GPA_MFPL_PA0MFP_Msk))  | (SYS_GPA_MFPL_PA0MFP_UART0_RXD);break;
	case PA2:  SYS->GPA_MFPL = (SYS->GPA_MFPL & ~(SYS_GPA_MFPL_PA2MFP_Msk))  | (SYS_GPA_MFPL_PA2MFP_UART1_RXD);break;
	case PA4:  SYS->GPA_MFPL = (SYS->GPA_MFPL & ~(SYS_GPA_MFPL_PA4MFP_Msk))  | (SYS_GPA_MFPL_PA4MFP_UART0_RXD);break;
	case PA6:  SYS->GPA_MFPL = (SYS->GPA_MFPL & ~(SYS_GPA_MFPL_PA6MFP_Msk))  | (SYS_GPA_MFPL_PA6MFP_UART0_RXD);break;
	case PA8:  SYS->GPA_MFPH = (SYS->GPA_MFPH & ~(SYS_GPA_MFPH_PA8MFP_Msk))  | (SYS_GPA_MFPH_PA8MFP_UART1_RXD);break;
	case PA15: SYS->GPA_MFPH = (SYS->GPA_MFPH & ~(SYS_GPA_MFPH_PA15MFP_Msk)) | (SYS_GPA_MFPH_PA15MFP_UART0_RXD);break;
	case PC0:  SYS->GPC_MFPL = (SYS->GPC_MFPL & ~(SYS_GPC_MFPL_PC0MFP_Msk))  | (SYS_GPC_MFPL_PC0MFP_UART2_RXD);break;
	case PC4:  SYS->GPC_MFPL = (SYS->GPC_MFPL & ~(SYS_GPC_MFPL_PC4MFP_Msk))  | (SYS_GPC_MFPL_PC4MFP_UART2_RXD);break;
	case PF1:  SYS->GPF_MFPL = (SYS->GPF_MFPL & ~(SYS_GPF_MFPL_PF1MFP_Msk))  | (SYS_GPF_MFPL_PF1MFP_UART1_RXD);break;
	case PF2:  SYS->GPF_MFPL = (SYS->GPF_MFPL & ~(SYS_GPF_MFPL_PF2MFP_Msk))  | (SYS_GPF_MFPL_PF2MFP_UART0_RXD);break;
	case PF5:  SYS->GPF_MFPL = (SYS->GPF_MFPL & ~(SYS_GPF_MFPL_PF5MFP_Msk))  | (SYS_GPF_MFPL_PF5MFP_UART2_RXD);break;
  case PB0:  SYS->GPB_MFPL = (SYS->GPB_MFPL & ~(SYS_GPB_MFPL_PB0MFP_Msk))  | (SYS_GPB_MFPL_PB0MFP_UART2_RXD);break;
	case PB2:  SYS->GPB_MFPL = (SYS->GPB_MFPL & ~(SYS_GPB_MFPL_PB2MFP_Msk))  | (SYS_GPB_MFPL_PB2MFP_UART1_RXD);break;
	case PB4:  SYS->GPB_MFPL = (SYS->GPB_MFPL & ~(SYS_GPB_MFPL_PB4MFP_Msk))  | (SYS_GPB_MFPL_PB4MFP_UART2_RXD);break;
	case PB6:  SYS->GPB_MFPL = (SYS->GPB_MFPL & ~(SYS_GPB_MFPL_PB6MFP_Msk))  | (SYS_GPB_MFPL_PB6MFP_UART1_RXD);break;
	case PB8:  SYS->GPB_MFPH = (SYS->GPB_MFPH & ~(SYS_GPB_MFPH_PB8MFP_Msk))  | (SYS_GPB_MFPH_PB8MFP_UART0_RXD);break;
	case PB12: SYS->GPB_MFPH = (SYS->GPB_MFPH & ~(SYS_GPB_MFPH_PB12MFP_Msk)) | (SYS_GPB_MFPH_PB12MFP_UART0_RXD);break;
		
	case PE15: SYS->GPE_MFPH = (SYS->GPE_MFPH & ~(SYS_GPE_MFPH_PE15MFP_Msk)) | (SYS_GPE_MFPH_PE15MFP_UART2_RXD);break;
		
	default:
		break;
	}

	switch(uart->txpin) {
	case PA1:  SYS->GPA_MFPL = (SYS->GPA_MFPL & ~(SYS_GPA_MFPL_PA1MFP_Msk))  | (SYS_GPA_MFPL_PA1MFP_UART0_TXD);break;
	case PA3:  SYS->GPA_MFPL = (SYS->GPA_MFPL & ~(SYS_GPA_MFPL_PA3MFP_Msk))  | (SYS_GPA_MFPL_PA3MFP_UART1_TXD);break;
	case PA5:  SYS->GPA_MFPL = (SYS->GPA_MFPL & ~(SYS_GPA_MFPL_PA5MFP_Msk))  | (SYS_GPA_MFPL_PA5MFP_UART0_TXD);break;
	case PA7:  SYS->GPA_MFPL = (SYS->GPA_MFPL & ~(SYS_GPA_MFPL_PA7MFP_Msk))  | (SYS_GPA_MFPL_PA7MFP_UART0_TXD);break;
	case PA9:  SYS->GPA_MFPH = (SYS->GPA_MFPH & ~(SYS_GPA_MFPH_PA9MFP_Msk))  | (SYS_GPA_MFPH_PA9MFP_UART1_TXD);break;
	case PA14: SYS->GPA_MFPH = (SYS->GPA_MFPH & ~(SYS_GPA_MFPH_PA14MFP_Msk)) | (SYS_GPA_MFPH_PA14MFP_UART0_TXD);break;
	case PC1:  SYS->GPC_MFPL = (SYS->GPC_MFPL & ~(SYS_GPC_MFPL_PC1MFP_Msk))  | (SYS_GPC_MFPL_PC1MFP_UART2_TXD);break;
	case PC5:  SYS->GPC_MFPL = (SYS->GPC_MFPL & ~(SYS_GPC_MFPL_PC5MFP_Msk))  | (SYS_GPC_MFPL_PC5MFP_UART2_TXD);break;
	case PF0:  SYS->GPF_MFPL = (SYS->GPF_MFPL & ~(SYS_GPF_MFPL_PF0MFP_Msk))  | (SYS_GPF_MFPL_PF0MFP_UART1_TXD);break;
	case PF3:  SYS->GPF_MFPL = (SYS->GPF_MFPL & ~(SYS_GPF_MFPL_PF3MFP_Msk))  | (SYS_GPF_MFPL_PF3MFP_UART0_TXD);break;
	case PF4:  SYS->GPF_MFPL = (SYS->GPF_MFPL & ~(SYS_GPF_MFPL_PF4MFP_Msk))  | (SYS_GPF_MFPL_PF4MFP_UART2_TXD);break;
	case PB1:  SYS->GPB_MFPL = (SYS->GPB_MFPL & ~(SYS_GPB_MFPL_PB1MFP_Msk))  | (SYS_GPB_MFPL_PB1MFP_UART2_TXD);break;
	case PB3:  SYS->GPB_MFPL = (SYS->GPB_MFPL & ~(SYS_GPB_MFPL_PB3MFP_Msk))  | (SYS_GPB_MFPL_PB3MFP_UART1_TXD);break;
	case PB5:  SYS->GPB_MFPL = (SYS->GPB_MFPL & ~(SYS_GPB_MFPL_PB5MFP_Msk))  | (SYS_GPB_MFPL_PB5MFP_UART2_TXD);break;
	case PB7:  SYS->GPB_MFPL = (SYS->GPB_MFPL & ~(SYS_GPB_MFPL_PB7MFP_Msk))  | (SYS_GPB_MFPL_PB7MFP_UART1_TXD);break;
	case PB9:  SYS->GPB_MFPH = (SYS->GPB_MFPH & ~(SYS_GPB_MFPH_PB9MFP_Msk))  | (SYS_GPB_MFPH_PB9MFP_UART0_TXD);break;	
	case PB13: SYS->GPB_MFPH = (SYS->GPB_MFPH & ~(SYS_GPB_MFPH_PB13MFP_Msk)) | (SYS_GPB_MFPH_PB13MFP_UART0_TXD);break;
		
	case PE14: SYS->GPE_MFPH = (SYS->GPE_MFPH & ~(SYS_GPE_MFPH_PE14MFP_Msk)) | (SYS_GPE_MFPH_PE14MFP_UART2_TXD);break;

	default:
		break;
	}
	#endif
	
	switch(uart->depin) {
	case PD8:  SYS->GPD_MFPH = (SYS->GPD_MFPH & ~(SYS_GPD_MFPH_PD8MFP_Msk))  | (SYS_GPD_MFPH_PD8MFP_UART2_nRTS);break;
	default:
		break;
	}

	/* Lock protected registers */
	SYS_LockReg();

	/* Configure UART */
	UART_OpenEx((UART_T *) uart->addr, uart->baudrate, DATABITS[uart->databits], PARITY[uart->parity], STOPBITS[uart->stopbits]);

}

void bsp_hal_uart_enable_rx_int(uart_t * const uart, const uint8_t priority) {

	IRQn_Type nvic_irq = (IRQn_Type)uart_irq_number_get(uart->index);

	/* set the priority and enable the selected IRQ */
	NVIC_SetPriority(nvic_irq, priority);
	NVIC_EnableIRQ(nvic_irq);

	UART_EnableInt((UART_T *) uart->addr, UART_INTEN_RDAIEN_Msk);

