ferhatkdz/EDM_Control/bsp_hal/src/bsp_hal_nu_m251.c
}

void bsp_hal_uart_set_rx_irqhandler(UartDataReceivedIRQhandler irqhandler) {
	if (irqhandler != 0) uartDataReceivedIRQhandler = irqhandler;
}

void bsp_hal_uart_transmit(uart_t * const uart, uint8_t * const data, const uint8_t length) {
	for (int i=0; i<length; i++) {
		UART_WRITE((UART_T *) uart->addr, data[i]);
		while(UART_IS_TX_FULL((UART_T *) uart->addr));
	}

	//while(!UART_GET_TX_EMPTY((UART_T *) uart->addr));
	
	UART_WAIT_TX_EMPTY((UART_T *) uart->addr);
}

void UART0_IRQHandler(void) 
{		
#if defined(UART0)
	/* Rx Ready INT */
	if(UART_GET_INT_FLAG(UART0, UART_INTSTS_RDAINT_Msk | UART_INTSTS_RXTOINT_Msk)) {
		uint8_t data =  UART_READ(UART0);
		/* call uart handler */
		if (uartDataReceivedIRQhandler != 0) uartDataReceivedIRQhandler(UART_IND0,data); 
	}
#endif
}

void UART1_IRQHandler(void) 
{		
#if defined(UART1)
	/* Rx Ready INT */
	if(UART_GET_INT_FLAG(UART1, UART_INTSTS_RDAINT_Msk | UART_INTSTS_RXTOINT_Msk)) {
		uint8_t data =  UART_READ(UART1);
		/* call uart handler */
		if (uartDataReceivedIRQhandler != 0) uartDataReceivedIRQhandler(UART_IND1,data); 
	}
#endif
}

void UART2_IRQHandler(void) 
{		
#if defined(UART2)
	/* Rx Ready INT */
	if(UART_GET_INT_FLAG(UART2, UART_INTSTS_RDAINT_Msk | UART_INTSTS_RXTOINT_Msk)) {
		uint8_t data =  UART_READ(UART2);
		/* call uart handler */
		if (uartDataReceivedIRQhandler != 0) uartDataReceivedIRQhandler(UART_IND2,data); 
	}
#endif
}


void UART3_IRQHandler(void) 
{		
#if defined(UART3)
	/* Rx Ready INT */
	if(UART_GET_INT_FLAG(UART3, UART_INTSTS_RDAINT_Msk | UART_INTSTS_RXTOINT_Msk)) {
		uint8_t data =  UART_READ(UART3);
		/* call uart handler */
		if (uartDataReceivedIRQhandler != 0) uartDataReceivedIRQhandler(UART_IND3,data); 
	}
#endif
}



/* eeprom emulation */


/* Exported constants --------------------------------------------------------*/
/* Page size */



/* Pages 0 and 1 base and end addresses */ 
#define PAGE0_BASE_ADDRESS  (uint32_t)(EEPROM_START_ADDRESS + (uint16_t)0x0000)
#define PAGE0_END_ADDRESS   (uint32_t)(EEPROM_START_ADDRESS + (PAGE_SIZE - 1))

#define PAGE1_BASE_ADDRESS  (uint32_t)(EEPROM_START_ADDRESS + PAGE_SIZE)
#define PAGE1_END_ADDRESS   (uint32_t)(EEPROM_START_ADDRESS + (2 * PAGE_SIZE - 1))


/* Used Flash pages for EEPROM emulation */
#define PAGE0    					0x00
#define PAGE1    					0x01

/* No valid page define */
#define NO_VALID_PAGE    	0xAB

/* Page status definitions */
#define EMPTY_DATA      	(uint32_t)0xFFFFFFFF      /* PAGE is marked to receive data */
#define RECEIVE_DATA      (uint32_t)0xEEEEEEEE      /* PAGE is marked to receive data */
#define VALID_PAGE       	(uint32_t)0x00000000      /* PAGE containing valid data */

/* Valid pages in read and write defines */
#define READ_FROM_VALID_PAGE    (uint8_t)0x00
#define WRITE_IN_VALID_PAGE     (uint8_t)0x01

/* Page full define */
#define PAGE_FULL    (uint8_t)0x80
#define WRITE_ERR    (uint8_t)0x81


/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/
/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/

/* Global variable used to store variable value in read sequence */
uint16_t DataVar = 0 ;

/* Virtual address defined by the user: 0xFFFF value is prohibited */

extern const uint16_t NumbOfVar; /* Variables' number */
extern const uint16_t VirtAddVarTab[];


/* Private function prototypes -----------------------------------------------*/
extern void    FLASH_PageErase(uint32_t PageAddress);
/* Private functions ---------------------------------------------------------*/
static uint8_t EE_FindValidPage(uint8_t operation);
static uint8_t EE_VerifyPageFullWriteVariable(uint16_t VirtAddress, uint16_t Data);
static uint8_t EE_PageTransfer(uint16_t VirtAddress, uint16_t Data);

/*******************************************************************************
* Function Name  : EE_Format
* Description    : Erases PAGE0 and PAGE1 and writes VALID_PAGE header to PAGE0
* Input          : None
* Output         : None
* Return         : Status of the last operation (Flash write or erase) done during
*                  EEPROM formating
*******************************************************************************/
void EE_Format(void)
{
	// Erase page 0
  FMC_Erase(PAGE0_BASE_ADDRESS);

	// Erase page 1
  FMC_Erase(PAGE1_BASE_ADDRESS);
	
	/* set page0 as valid page word1 */
	FMC_Write(PAGE0_BASE_ADDRESS, VALID_PAGE);

	/* set page0 as valid page word2 */
	FMC_Write(PAGE0_BASE_ADDRESS+4, VALID_PAGE);
}


/*******************************************************************************
* Function Name  : EE_Format
* Description    : Erases PAGE0 and PAGE1 and writes VALID_PAGE header to PAGE0
* Input          : None
* Output         : None
* Return         : Status of the last operation (Flash write or erase) done during
*                  EEPROM formating
*******************************************************************************/
void EE_Erase(uint32_t PageBaseAddress)
{
	/* erase target page */
	FMC_Erase(PageBaseAddress);
}

/*******************************************************************************
* Function Name  : EE_FindValidPage
* Description    : Find valid Page for write or read operation
* Input          : - Operation: operation to achieve on the valid page:
*                      - READ_FROM_VALID_PAGE: read operation from valid page
*                      - WRITE_IN_VALID_PAGE: write operation from valid page
* Output         : None
* Return         : Valid page number (PAGE0 or PAGE1) or NO_VALID_PAGE in case
*                  of no valid page was found
*******************************************************************************/
uint8_t EE_FindValidPage(uint8_t Operation)
{
  uint32_t PageStatus0 = EMPTY_DATA,PageStatus00, PageStatus01;
	uint32_t PageStatus1 = EMPTY_DATA,PageStatus10, PageStatus11;

