ferhatkdz/EDM_Control/bsp_hal/src/bsp_hal_nu_m251.c
/*******************************************************************************
* Function Name  : EE_PageTransfer
* Description    : Transfers last updated variable data from the full Page to
*                  an empty one.
* Input          : - VirtAddress: 16 bit virtual address of the variable
*                  - Data: 16 bit data to be written as variable value
* Output         : None
* Return         : - Success or error status:
*                      - FLASH_COMPLETE: on success,
*                      - PAGE_FULL: if valid page is full
*                      - NO_VALID_PAGE: if no valid page was found
*                      - Flash error code: on write Flash error
*******************************************************************************/
uint8_t EE_PageTransfer(uint16_t VirtAddress, uint16_t Data)
{
  uint32_t NewPageAddress, OldPageAddress;
  uint16_t VarIdx = 0;
	uint32_t ValidPage = PAGE0;
  uint8_t EepromStatus = 0, ReadStatus = 0;

  /* Get active Page for read operation */
  ValidPage = EE_FindValidPage(READ_FROM_VALID_PAGE);

  if (ValidPage == PAGE1)        /* Page1 valid */
  {
    /* New page address where variable will be moved to */
    NewPageAddress = PAGE0_BASE_ADDRESS;
    /* Old page address where variable will be taken from */
    OldPageAddress = PAGE1_BASE_ADDRESS;

  }
  else if (ValidPage == PAGE0)   /* Page0 valid */
  {
    /* New page address where variable will be moved to */
    NewPageAddress = PAGE1_BASE_ADDRESS;
    /* Old page address where variable will be taken from */
    OldPageAddress = PAGE0_BASE_ADDRESS;
  }
  else
  {
    return NO_VALID_PAGE;       /* No valid Page */
  }

  /* Set the new Page status to RECEIVE_DATA status */
  FMC_Write(NewPageAddress, VALID_PAGE);
	
  /* Write the variable passed as parameter in the new active page */
  EepromStatus = EE_VerifyPageFullWriteVariable(VirtAddress, Data);
  /* If program operation was failed, a Flash error code is returned */
  if (EepromStatus != 0)
  {
    return EepromStatus;
  }

  /* Transfer process: transfer variables from old to the new active page */
  for (VarIdx = 0; VarIdx < NumbOfVar; VarIdx++)
  {
    if (VirtAddVarTab[VarIdx] != VirtAddress)  /* Check each variable except the one passed as parameter */
    {
      /* Read the other last variable updates */
      ReadStatus = EE_ReadVariable(VirtAddVarTab[VarIdx], &DataVar);
      /* In case variable corresponding to the virtual address was found */
      if (ReadStatus != 0x01)
      {
        /* Transfer the variable to the new active page */
        EepromStatus = EE_VerifyPageFullWriteVariable(VirtAddVarTab[VarIdx], DataVar);
        /* If program operation was failed, a Flash error code is returned */
        if (EepromStatus != 0)
        {
          return EepromStatus;
        }
      }
    }
  }

  /* Erase the old Page: Set old Page status to ERASED status */
	EE_Erase(OldPageAddress);

  /* Set new Page status to VALID_PAGE status */
  FMC_Write(NewPageAddress+4, VALID_PAGE);
	
  
  /* Return last operation flash status */
  return 0;
}

/*******************************************************************************
* Function Name  : EE_WriteVariable
* Description    : Writes/updates variable data in EEPROM.
* Input          : - VirtAddress: Variable virtual address
*                  - Data: 16 bit data to be written
* Output         : None
* Return         : - Success or error status:
*                      - FLASH_COMPLETE: on success,
*                      - PAGE_FULL: if valid page is full
*                      - NO_VALID_PAGE: if no valid page was found
*                      - Flash error code: on write Flash error
*******************************************************************************/
uint8_t EE_WriteVariable(uint16_t VirtAddress, uint16_t Data)
{
  uint8_t Status = WRITE_ERR;
	uint16_t ReadData;

	/* Check the variable has same value */
	if (EE_ReadVariable(VirtAddress,&ReadData)==0){
		if (ReadData==Data) {
			return 0;
		}
	}
	
	/* Write the variable virtual address and value in the EEPROM */
	Status = EE_VerifyPageFullWriteVariable(VirtAddress, Data);
	/* In case the EEPROM active page is full */
	if (Status == PAGE_FULL)
	{
		/* Perform Page transfer */
		Status = EE_PageTransfer(VirtAddress, Data);
	}

  /* Return last operation status */
  return Status;
}


uint8_t EE_ReadVariable32(uint16_t VirtAddressStart, uint32_t* ReadData)
{
	uint8_t Status;
	uint16_t Data;
	
	Status = EE_ReadVariable(VirtAddressStart,&Data);
	if (Status!=0) return Status;
	
	*ReadData = Data;
	*ReadData<<=16;
	
	Status = EE_ReadVariable(VirtAddressStart+1,&Data);
	if (Status!=0) return Status;
	
	*ReadData |= Data;

  /* Return ReadStatus value: (0: variable exist, 1: variable doesn't exist) */
  return Status;
}

uint8_t EE_WriteVariable32(uint16_t VirtAddressStart, uint32_t Data)
{
	uint8_t Status = 0;
	
	Status = EE_WriteVariable(VirtAddressStart,Data>>16);
	Status = EE_WriteVariable(VirtAddressStart+1,Data);
	
	/* Return last operation status */
	return Status;
}




